You can find this notebook here:
https://github.com/luwu29/Python_projects/blob/master/Workshop_Titanic.ipynb

Or more here:
https://github.com/luwu29/Python-Data-Science-Tools/blob/master/Lu's%20Python%20Manual%20(Regularly%20Updated).ipynb

# <h1 style="color:#e6004c;"> Import data and packages </h1>

In [3]:
import pandas as pd
import numpy as np
import seaborn as sns

In [4]:
#sns.get_dataset_names()

In [5]:
titanic=sns.load_dataset('titanic')

# EDA

In [183]:
#pip install pandas-profiling

In [74]:
import pandas_profiling
pandas_profiling.ProfileReport(titanic)

In [81]:
titanic.info() #overview of data types and missing values
#in terms of using space: category < object

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
survived       891 non-null int64
pclass         891 non-null int64
sex            891 non-null object
age            714 non-null float64
sibsp          891 non-null int64
parch          891 non-null int64
fare           891 non-null float64
embarked       889 non-null object
class          891 non-null category
who            891 non-null object
adult_male     891 non-null bool
deck           203 non-null category
embark_town    889 non-null object
alive          891 non-null object
alone          891 non-null bool
dtypes: bool(2), category(2), float64(2), int64(4), object(5)
memory usage: 80.6+ KB

In [135]:
# convert data types
titanic = titanic.astype({'sex':'category', 'alive':'category', 'alone':'category'})
titanic.dtypes, titanic.info()  #68.7 kb now

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
survived       891 non-null int64
pclass         891 non-null int64
sex            891 non-null category
age            891 non-null float64
sibsp          891 non-null int64
parch          891 non-null int64
fare           891 non-null float64
embarked       889 non-null object
class          891 non-null category
who            891 non-null object
adult_male     891 non-null bool
deck           203 non-null category
embark_town    889 non-null object
alive          891 non-null category
alone          891 non-null category
dtypes: bool(1), category(5), float64(2), int64(4), object(3)
memory usage: 68.7+ KB

(survived          int64
 pclass            int64
 sex            category
 age             float64
 sibsp             int64
 parch             int64
 fare            float64
 embarked         object
 class          category
 who              object
 adult_male         bool
 deck           category
 embark_town      object
 alive          category
 alone          category
 dtype: object, None)

## Numerica Variables

In [47]:
titanic.describe() #summary statistics of countinuous variables

         survived      pclass         age       sibsp       parch        fare
count  891.000000  891.000000  891.000000  891.000000  891.000000  891.000000
mean     0.383838    2.308642   29.699118    0.523008    0.381594   32.204208
std      0.486592    0.836071   13.002015    1.102743    0.806057   49.693429
min      0.000000    1.000000    0.420000    0.000000    0.000000    0.000000
25%      0.000000    2.000000   22.000000    0.000000    0.000000    7.910400
50%      0.000000    3.000000   29.699118    0.000000    0.000000   14.454200
75%      1.000000    3.000000   35.000000    1.000000    0.000000   31.000000
max      1.000000    3.000000   80.000000    8.000000    6.000000  512.329200

### Separate continuous variables to a new df:  titanic_num
Two ways:

In [10]:
# 1: Pass on the columns in titanic.describe() into loc slicing
titanic.describe().columns
titanic_num=titanic.loc[:,titanic.describe().columns] #a new df with only numeric columns

In [11]:
#2: alternatively, you now can select columns by datatype
titanic_num=titanic.select_dtypes(include='number')

In [43]:
titanic_num.tail(10) # same results

     survived  pclass   age  sibsp  parch     fare
881         0       3  33.0      0      0   7.8958
882         0       3  22.0      0      0  10.5167
883         0       2  28.0      0      0  10.5000
884         0       3  25.0      0      0   7.0500
885         0       3  39.0      0      5  29.1250
886         0       2  27.0      0      0  13.0000
887         1       1  19.0      0      0  30.0000
888         0       3   NaN      1      2  23.4500
889         1       1  26.0      0      0  30.0000
890         0       3  32.0      0      0   7.7500

## Categorical Varialbes

In [13]:
titanic.sex.value_counts() #examine the categorical variables

male      577
female    314
Name: sex, dtype: int64

In [51]:
# for a variable that have many unique values, if you just need to know how many levels are there...
titanic.sex.nunique() # titanic.sex.unique()

2

In [15]:
#counts=titanic.age.value_counts()

In [16]:
#counts.nsmallest(2)

In [17]:
#idx=counts.nsmallest(2).index

In [18]:
#idx

In [19]:
#titanic[titanic.age.isin(idx)]

## missing values

In [53]:
sum(titanic.deck.isna())  #titanic.deck.isnull() also works
#count the number of missing values

688

### drop missing values (rows or columns)

In [58]:
# del titanic.deck
# titanic_copy=titanic.copy()
# len(titanic)
titanic.shape

(891, 15)

In [21]:
df.dropna() # drop rows with any missing values
df.dropna(axis='columns') # drop columns with any missing values
df.dropna(thresh=2) #keep rows that has at least two non-missing values. 
#Or use np.infinite
df=df[np.infinite(df['x'])]

NameError: name 'df' is not defined

### impute missing values

In [22]:
#impute missing for age (mean, median)?

#use titanic_num here for computation. 
#lambda converts a function to a one-line code....

titanic_num.apply(lambda x:x.mean()-x.median()) #since mean and median are not that different, let's just use mean for imputation.

survived     0.383838
pclass      -0.691358
age          1.699118
sibsp        0.523008
parch        0.381594
fare        17.750008
dtype: float64

In [23]:
#impute missing cells of age
titanic.age=titanic.age.fillna(titanic.age.mean())

In [24]:
#now lets see if all missing values are gone
sum(titanic.age.isna()) #Done!

0

# <h1 style="color:#1ac6ff;"> Slicing </h1>

### iloc and loc

In [63]:
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [72]:
#Four ways of selecting columns
titanic.iloc[:, 2], titanic.sex, titanic['sex'], titanic.loc[:,'sex']

In [73]:
#selecting multiple columns
titanic.loc[:,('sex','age')] #pass a tuple inside 
titanic[['sex','age']] #pass a list inside

In [27]:
#filter rows using conditions 
titanic.loc[titanic['age']>titanic['age'].mean(), :] #selecting rows that have above mean age

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
1,1,1,female,38.000000,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
3,1,1,female,35.000000,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.000000,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
5,0,3,male,29.699118,0,0,8.4583,Q,Third,man,True,NaN,Queenstown,no,True
6,0,1,male,54.000000,0,0,51.8625,S,First,man,True,E,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
879,1,1,female,56.000000,0,1,83.1583,C,First,woman,False,C,Cherbourg,yes,False
881,0,3,male,33.000000,0,0,7.8958,S,Third,man,True,NaN,Southampton,no,True
885,0,3,female,39.000000,0,5,29.1250,Q,Third,woman,False,NaN,Queenstown,no,False
888,0,3,female,29.699118,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False
890,0,3,male,32.000000,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

In [28]:
display(titanic.describe().loc['min':'max'], 
titanic.describe().loc['min':'max', 'age':'parch'])

     survived  pclass        age  sibsp  parch      fare
min       0.0     1.0   0.420000    0.0    0.0    0.0000
25%       0.0     2.0  22.000000    0.0    0.0    7.9104
50%       0.0     3.0  29.699118    0.0    0.0   14.4542
75%       1.0     3.0  35.000000    1.0    0.0   31.0000
max       1.0     3.0  80.000000    8.0    6.0  512.3292

           age  sibsp  parch
min   0.420000    0.0    0.0
25%  22.000000    0.0    0.0
50%  29.699118    0.0    0.0
75%  35.000000    1.0    0.0
max  80.000000    8.0    6.0

# <h1 style="color:#00b386;"> Groupby </h1>

In [29]:
titanic.groupby('sex').survived.mean()

sex
female    0.742038
male      0.188908
Name: survived, dtype: float64

In [30]:
#what is the maximum age of passengers of each class?

In [31]:
titanic.groupby('class').age.max()

class
First     80.0
Second    70.0
Third     74.0
Name: age, dtype: float64

In [64]:
# Using agg to return more than one results
#the advantage is that it returns a df, that can be used for visualization or further transformations. 

titanic.groupby('class')['pclass', 'age'].agg(['max','min','mean'])

#k=titanic.groupby('class')['pclass', 'age'].agg(['max','min','mean'])

       pclass            age
          max min mean   max   min       mean
class
First       1   1    1  80.0  0.92  37.048118
Second      2   2    2  70.0  0.67  29.866958
Third       3   3    3  74.0  0.42  26.403259

## Unstack from groupby  (Long to wide pivot)

In [65]:
display(titanic.groupby(['sex', 'class']).survived.mean(),
titanic.groupby(['sex', 'class']).survived.mean().unstack())

sex     class
female  First     0.968085
        Second    0.921053
        Third     0.500000
male    First     0.368852
        Second    0.157407
        Third     0.135447
Name: survived, dtype: float64

class      First    Second     Third
sex
female  0.968085  0.921053  0.500000
male    0.368852  0.157407  0.135447

# <h1 style="color:#e69900;"> Indexing </h1>

In [38]:
k

       pclass            age
          max min mean   max   min       mean
class
First       1   1    1  80.0  0.92  37.048118
Second      2   2    2  70.0  0.67  29.866958
Third       3   3    3  74.0  0.42  26.403259

In [34]:
k.info()

<class 'pandas.core.frame.DataFrame'>
CategoricalIndex: 3 entries, First to Third
Data columns (total 6 columns):
(pclass, max)     3 non-null int64
(pclass, min)     3 non-null int64
(pclass, mean)    3 non-null int64
(age, max)        3 non-null float64
(age, min)        3 non-null float64
(age, mean)       3 non-null float64
dtypes: float64(3), int64(3)
memory usage: 251.0 bytes

In [35]:
k.index

CategoricalIndex(['First', 'Second', 'Third'], categories=['First', 'Second', 'Third'], ordered=False, name='class', dtype='category')

In [66]:
k

       pclass            age
          max min mean   max   min       mean
class
First       1   1    1  80.0  0.92  37.048118
Second      2   2    2  70.0  0.67  29.866958
Third       3   3    3  74.0  0.42  26.403259

In [71]:
#indexing and slicing go well together
k.loc['Second']['age']['max']

70.0

In [37]:
k.loc['Second']['age']

max     70.000000
min      0.670000
mean    29.866958
Name: Second, dtype: float64

In [39]:
# What's the average age of passengers in Third class? Which one is correct?
k.loc['Third']['age'].mean(), 
k.loc['Third']['age']['mean']

(33.607752885268155, 26.403258655804464)

In [40]:
k.loc['Third']['age']

max     74.000000
min      0.420000
mean    26.403259
Name: Third, dtype: float64

In [41]:
# Reset index
k.reset_index()
k.set_index(['age','pclass'])

    class pclass            age
             max min mean   max   min       mean
0   First      1   1    1  80.0  0.92  37.048118
1  Second      2   2    2  70.0  0.67  29.866958
2   Third      3   3    3  74.0  0.42  26.403259

<p style='text-align:center;font-size:160%; color:#ff3333;'> For multi-indexing, here are some good examples </p>

https://nbviewer.jupyter.org/github/justmarkham/pandas-videos/blob/master/pandas_multiindex.ipynb